bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L4x3.svd
2;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#190;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#190;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#190;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;-M4
              LOCKUP (Hardfault) output enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
